#define _CRT_SECURE_ON_WARNINGS
//运算符 加减（+/-） 乘除（*/\） 取模（%） 取余（\ 但左右操作数都是整形时生效）
//移位操作符
//位操作符
//赋值操作符
#include <stdio.h>

int main(){
    //移（二进制）位操作符
    //<< 左移
    //>> 右移
    short a = 1;
    //短整型占一个字节 -8bit位
    //00000001
    int b = a<<1;
    printf("%d\n",b);
    //00000100
    b = a<<3;
    printf("%d\n",b);

    printf("%d\n",a); //移位运算符号以后不变

    //（二进制）位操作
    // & 按位与 一假为假
    //｜ 按位或 一真为真
    // ^ 按位异或 相同0 相异1
    int x = 3;
    int y = 5;
    // x 011
    // y 101
    
    int z = x&y; // z 001
    printf ("%d\n", z);
    z = x|y; // z 111
    printf ("%d\n", z);
    z = x^y; // z 110
    printf ("%d\n", z);
    
    //
    //赋值操作符
    int Temp = 0;
    Temp = 10;
    Temp += 10;
    //......
    //单目操作符 !.-.+.sizeof（单位 字节）.++.--.~.*.(类型)<-强制类型转换
    //关系操作符
    //双目操作符 两个操作数
    //三目操作符 三个操作数 (... ? ... : ...) ?前真执行：前 假：后


    return 0;
}