#include <stdio.h>

int main(){
    //一）算数运算符 + - * / % 
    //‘%’ 的操作数只能是整数;'/'对于操作数为整数，浮点数所得结果不同的注意


    //二）移位操作符 '<<' '>>' 移动的是二进制 只可用于整数
    int a = 6;
    //'>>' 右移运算符
    //1.算数右移 2.逻辑右移
    //算数右移：右弃，左补原符号位
    //逻辑右移: 右弃，左补0
    //!!!在此是算数右移
    int b = a >> 1; printf ("%d\n" ,b);
    //'<<' 左移运算符
    //逻辑左移: 左弃，右补0
    //!!!在此是算数右移
    b = a << 1; printf ("%d\n" ,b);
    //计算机在内存中存的是二进制的补码

    //三)位操作数 只鹅看用于整数
    //& 按2进制位与
    int q = 3;
    int w = 5;
    int e = q&w;
    printf("%d\n" ,e);
    //| 按2进制位或
    int r = q|w;
    printf("%d\n" ,r);
    //^ 按2进制位异或 同0异1
    int t = q^w;
    printf("%d\n" ,t);
    //一个特殊的题目 不创建tmp交换 使用异或解决问题
    int y = 3;
    int z = 5;
    //t 00000011
    //y 00000101
    //方法一：加减法 缺陷：由于计算的是整形 当规模大 就会溢出
    y = y+z;
    z = y-z;
    y = y-z;
    printf ("y=%d z=%d\n" ,y,z);
    //方法二：异或法!!!
    y = 3;
    z = 5;
    y = y^z; //y = 6
    z = y^z; //z = 3
    y = y^z; //y = 5
    printf ("y=%d z=%d\n" ,y,z);

    //四)赋值运算符
    //1.'='
    //2.复合赋值运算符 += -+ *= /= %= >>= <<= &= \= ^=

    //五)单目运算符
    //! - + &[取地址操作符] sizeof ~[对一个数二进制按位取反] -- ++ * (类型)[强制转换]
    int u = 0;
    int i = ~u; //?????
    printf("%d\n" ,i);
    //00000000000000000000000000000000
    //11111111111111111111111111111111 -补码
    //11111111111111111111111111111110 -反码
    //10000000000000000000000000000001 -原码

    short s = 0;
    a = 0;
    printf ("%d " ,(int)sizeof(s = a+10)); //sizeof 内不进行真实运算
    printf ("%d \n" ,s);

    //六)条件运算符 [三目运算符] 表达式1?表达式2:表达式3

    //七)关系运算符 && || 
    //注意 && 只要判断为假 之后就不用再算
    //注意 || 只要判断为真 之后就不用再计算
    
    //八)逗号表达式 从左至右依次计算 exp1,exp2,exp3;
    a = 1;
    b = 2;
    c = (a = a+b ,b = a-b);

    //九)下标引用操作符[] 函数调用操作符() 结构成员访问操作符 .  结构体指针操作符 ->
    int arr[10] = {0};
    arr[0] = 1;
    arr + 1 = 2;
    int count = 0;
    while(count < 10){
        printf("%d " ,arr[0 + count]);
        count ++;

    }

}