//隐式的类型转换
#include <stdio.h>

int main(){
    //1)整型(int)提升 表达式中不足 达到int类型的 为保证精度 都提升为int类型 后截断为原类型字长
    //提升时 补原类型二进制最高位
    char a = 3;
    //00000000000000000000000000000011 = 3(ten)
    //00000011 - a
    char b = 127;
    //00000000000000000000000001111111 = 127(ten)
    //01111111 - b
    char c = a + b;
    //相加时
    //00000000000000000000000000000011
    //00000000000000000000000001111111
    //00000000000000000000000010000010

    //表达式赋值给c
    //10000010 - c

    printf ("%d \n",c);
    //11111111111111111111111110000010 - 补码   由于%d原因再整型提升
    //10000000000000000000000001111110 - 原码
    //打印 -126


    //EG2
    char i = 1;
    printf ("%u" ,sizeof(+i));
    printf ("%u" ,sizeof(i));
    printf ("%u" ,sizeof(-i));
    return 0;
}